In [1]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [2]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [4]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [5]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [6]:
df.loc[2:4, ['name', 'age', 'state']]

    name  age       state
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington

In [7]:
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [8]:
df.iloc[:, 0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [14]:
df.loc[:, ['name', 'age', 'state']] # same as df.loc[:, ['name', 'age', 'state']]
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [15]:
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

In [16]:
df[df['age'] > 30] # same as df[df.age > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [17]:
df[df.num_pets > df.num_children]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [42]:
df[(df.age > 40) & (df.num_pets > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [48]:
df.drop(0, axis=0)

    name  age       state  num_children  num_pets
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [50]:
import numpy as np
df[['age', 'num_pets', 'num_children']].mean()
df[['age', 'num_pets', 'num_children']].apply(lambda col: col.mean(), axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [52]:
df[['age', 'num_pets', 'num_children']].apply(lambda col: col.sum(), axis=0)

age             220
num_pets          9
num_children      8
dtype: int64

In [53]:
df.sum()

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

In [54]:
df.age

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [55]:
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [59]:
pd.DataFrame(df.age)

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [60]:
df['test a'] = df['num_children']

In [61]:
df

    name  age       state  num_children  num_pets  test a
0   john   23        iowa             2         0       2
1   mary   78          dc             2         4       2
2  peter   22  california             0         0       0
3   jeff   19       texas             1         5       1
4   bill   45  washington             2         0       2
5   lisa   33          dc             1         0       1

In [65]:
df.num_pets

0    0
1    4
2    0
3    5
4    0
5    0
Name: num_pets, dtype: int64

In [66]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
p = d.pivot(index='Item', columns='CType', values='USD')